#### ValidateConnectivity Method

---

|  |
| --- |
| FabricationUtils Class   See Also |

Check if two connectors are valid to connect directly without couplings

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static bool ValidateConnectivity( 	Document document, 	Connector connector1, 	Connector connector2 ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ValidateConnectivity ( _ 	document As Document, _ 	connector1 As Connector, _ 	connector2 As Connector _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ValidateConnectivity( 	Document^ document,  	Connector^ connector1,  	Connector^ connector2 ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

connector1
:   Type:  Autodesk.Revit.DB Connector
     First connector to check.

connector2
:   Type:  Autodesk.Revit.DB Connector
     Second connector to check against.

#### Return Value

True if connection is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationUtils Class

Autodesk.Revit.DB.Fabrication Namespace